Revit 2027 API
ColumnAttachment.IsValidColumn Method
 Says whether a FamilyInstance supports column attachments.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidColumn(
	FamilyInstance familyInstance
)
Public Shared Function IsValidColumn (
	familyInstance As FamilyInstance
) As Boolean
public:
static bool IsValidColumn(
	FamilyInstance^ familyInstance
)
static member IsValidColumn :
        familyInstance : FamilyInstance -> bool
Parameters
familyInstance FamilyInstance
 A column.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 In-place columns do not support attachments.
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace